Revit 2027 API
MeshFromGeometryOperationResult Properties
The MeshFromGeometryOperationResult type exposes the following members.
Properties
Name | Description
HasInvalidData |  Whether the provided data for which this result was obtained were internally inconsistent and could not be used in its entirety. For example, for extrusion operation, profile loops were degenerate or improperly oriented with respect to the extrsuion direction.
IsMeshAvailable |  Shows whether the result still contains the mesh which was constructed, if any, or whether it has been relinquished by 'getMesh'. The former is true, the later is false.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Tessellated |  Whether while constructing a mesh, it was necessary to extrude polylines instead of non-linear curves from the profile loops.
Top
See Also
Reference
MeshFromGeometryOperationResult Class
Autodesk.Revit.DB Namespace